Tekla Open API Reference for Tekla Structures 2025
View.ViewShorteningAttributes Constructor
 Creates a new default view shortening attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewShorteningAttributes()
Public Sub New
See Also
Reference
View.ViewShorteningAttributes Class
View.ViewShorteningAttributes Overload
Tekla.Structures.Drawing Namespace